###################Path#######################################
DATA_PATH = 'E://factor_comb//data//'



###################TEST Factor#################################


###################RAW Factor#################################
VALUE = ['1/PFCF', 'EBITDA/EV', 'S/EV', '1/PE',
		'1/PB',	'1/PS',	'1/POP','总市值','1/PIC','1/PBE','总资产']


PROFIT = 	['ROIC1',	'ROIC','ROE', 'deltaROE','CROIC','EP','营运报酬率','资本报酬率','EBITDA-资本支出/IC',
			'ROA',	'毛利率',	'净利率','Delta毛利率','毛利/净资产','毛利/总资产','毛利/EV','营业利润/净资产',
			'营业利润率',		'FCF/营业收入',
			'销售现金比','现金营业收入比','经营现金净流入/资本支出','经营现金流/净资产','外部融资额/总资产','负债/投入资本']

PROFIT_IMPROVE = [	'Delta营业利润率',
					'DeltaATO',
					'DeltaATOdp',
					'Delta运营资产周转率',
					'NOA',
					'DeltaBK',
					'DeltaTA',
					'deltaNR',
					'Accrual',
					'Accrual2NI']



GROWTH = ['最新一季销售毛利润增长率','最新一季营业利润增长率',
		'最新一季营业收入增长率','最新一季净利润增长率','TTM营业利润增长率','Delta预期当年净利润增长率2','目标收益率','Delta预期增长率','Delta预期增长率2','预期PE','预期PEG']

#GROWTH_ = ['Delta预期增长率','Delta预期增长率2','Delta预期当年净利润增长率2','目标收益率','预期增长率','最近3个月动量','最近6个月动量','最近一年动量','最近三年动量','delta营业利润增速']
GROWTH_ = []

TRADE = ['近一个月跌幅','近三个月跌幅', 'ILLIQ','SKEW','5/60',
		'波动率','波动率1','股东人数变化率','换手率','最近3个月动量','最近6个月动量','最近一年动量']


#FACTOR_LIST = ['Delta预期当年净利润增长率2','1/PB;总市值;ROE;Accrual2NI;最新一季营业利润增长率']
#FACTOR_LIST = ['总市值;1/PB;ROIC1;最新一季营业利润增长率']
FACTOR_LIST = ['总市值;1/PB;ROE;最新一季营业利润增长率']
#FACTOR_LIST = ['Delta预期当年净利润增长率2','总市值','1/PB','ROIC1','最新一季营业利润增长率']


